package TestNetwork;

import java.util.*;
public class TestStart
{
    public static void main(String[] args)
    {
        Scanner sc = new Scanner(System.in);
        int month = 0;
        int day = 0;
        System.out.println("Please input your birthday month[1-12]");
        month = sc.nextInt();

        while(0==month)
        {
            System.out.println("Warning!Please input your birthday month[1-12]");
            month =sc.nextInt();
        }
        System.out.println("Please input your birthday day[1-30]");
        day =sc.nextInt();
        while(0==day)
        {
            System.out.println("Warning!Please input your birthday day[1-30]");
            day =sc.nextInt();
        }

        switch(month)
        {
            case 1:
                if(day>=1 && day <= 19)
                {
                    System.out.println("您的星座是摩羯座;\n 优点：优越、聪明、实际、野心、可靠、不屈不挠、宽大 、乐观 \n 缺点：顽固、暴躁、享乐主义、孤独、不灵活、疑神疑鬼 ");
                }
                else
                {
                    System.out.println("您的星座是水瓶座;\n 优点：独创力、宽容、理想、先见之明、友爱、慈善、独立 \n  缺点：残忍、不服从、性自由主义、冒然行动、无远虑、情欲、胆小 ");
                }
                break;
            case 2:
                if(day>=1 && day <= 18)
                {
                    System.out.println("您的星座是水瓶座;\n 优点： 独创力、宽容、理想、先见之明、友爱、慈善、独立\n 缺点：残忍、不服从、性自由主义、冒然行动、无远虑、情欲、胆小 ");
                }
                else
                {
                    System.out.println("您的星座是双鱼座 ;\n 优点：自觉、唯美的、柏拉图式的爱、幻想、牺牲奉献、 善良、好脾气\n 缺点：畏缩、逃避困难、感伤、优柔寡断、意志薄弱、不现实 ");
                }
                break;
            case 3:
                if(day>=1 && day <= 20)
                {
                    System.out.println("您的星座是双鱼座; \n 优点：自觉、唯美的、柏拉图式的爱、幻想、牺牲奉献、 善良、好脾气\n 缺点： 畏缩、逃避困难、感伤、优柔寡断、意志薄弱、不现实");
                }
                else
                {
                    System.out.println("您的星座是白羊座 ;\n 优点：充满希望、和蔼可亲、行动力、活力充沛、诚心诚意、天生长才、勇敢 \n 缺点：稚拙、刚愎自用、性急、好战、急性子 ");
                }
                break;
            case 4:
                if(day>=1 && day <= 20)
                {
                    System.out.println("您的星座白羊座;\n 优点:充满希望、和蔼可亲、行动力、活力充沛、诚心诚意、天生长才、勇敢 \n 缺点：稚拙、刚愎自用、性急、好战、急性子 ");
                }
                else
                {
                    System.out.println("您的星座是金牛座 ;\n 优点：浪漫、决断能力、逻辑性思考、勤勉、灵巧、热心、忍耐心 \n 缺点：偏见、依赖心、不屑于小事、刚愎自用、求胜心强、心太软、固执 ");
                }
                break;
            case 5:
                if(day>=1 && day <= 20)
                {
                    System.out.println("您的星座是金牛座;\n 优点：浪漫、决断能力、逻辑性思考、勤勉、灵巧、热心、忍耐心 \n 缺点：偏见、依赖心、不屑于小事、刚愎自用、求胜心强、心太软、固执 ");
                }
                else
                {
                    System.out.println("您的星座是双子座 ; \n 优点：多样性、洞察力、开朗、反映机智、演技佳、宽大、魅力，善变 \n 缺点： 神经质、优柔寡断、性格不定、双重人格、浅薄、光说不做、投机取巧");
                }
                break;

            case 6:
                if(day>=1 && day <= 21)
                {
                    System.out.println("您的星座是双子座;\n 优点： 多样性、洞察力、开朗、反映机智、演技佳、宽大、魅力，善变 \n 缺点：神经质、优柔寡断、性格不定、双重人格、浅薄、光说不做、投机取巧 ");
                }
                else
                {
                    System.out.println("您的星座是巨蟹座 ;\n 优点： 第六感、主观、反应佳、想象力、慎重、执着、毅力 \n 缺点：情欲、贪婪、占有欲、敏感、感情、情绪化、无主见 ");
                }
                break;
            case 7:
                if(day>=1 && day <= 22)
                {
                    System.out.println("您的星座是巨蟹座;\n 优点： 第六感、主观、反应佳、想象力、慎重、执着、毅力\n 缺点：情欲、贪婪、占有欲、敏感、感情、情绪化、无主见 ");
                }
                else
                {
                    System.out.println("您的星座是狮子座 ;\n 优点：自尊心、慈善、权利、思考、保护他人、忠诚心、热情\n缺点： 情欲、贪婪、占有欲、敏感、感情、情绪化、无主见");
                }
                break;
            case 8:
                if(day>=1 && day <= 22)
                {
                    System.out.println("您的星座是狮子座; \n 优点：自尊心、慈善、权利、思考、保护他人、忠诚心、热情 \n 缺点：死爱面子活受罪, 好大喜功, 莫名的优越感, 喜欢接受奉承, 缺乏节俭的美德, 喜欢指挥别人, 缺乏耐心, 刚愎自用自以为是, 缅怀过去,能伸不能屈. ");
                }
                else
                {
                    System.out.println("您的星座是处女座 ;\n 优点:有板有眼、服务、鉴赏力、完美主义、谦虚、头脑清晰、实际 \n缺点：太过吹毛求疵,唠叨琐碎,杞人忧天穷紧张,自扫门前雪,有洁癖倾向.缺乏接受批评的雅量,不够浪漫,不尊重他人梦想.人际关系待加强,太过实际缺乏远见. ");
                }
                break;
            case 9:
                if(day>=1 && day <= 22)
                {
                    System.out.println("您的星座是处女座;\n 优点： 有板有眼、服务、鉴赏力、完美主义、谦虚、头脑清晰、实际 \n缺点： 太过吹毛求疵,唠叨琐碎,杞人忧天穷紧张,自扫门前雪,有洁癖倾向.缺乏接受批评的雅量,不够浪漫,不尊重他人梦想.人际关系待加强,太过实际缺乏远见.");
                }
                else
                {
                    System.out.println("您的星座是天秤座 ;\n 优点：理想主义、公正、追求、社交手腕强、审美观、魅力、 艺术力强、美丽、善良 \n  缺点：　优柔寡断犹豫不决,意志不坚定容易受人影响,怕得罪人,不能承受压力没有担当,过分要求公平吃不得亏,息事宁人治标不治本,总是自圆其说藉口太多,喜欢享受好逸恶劳,常不经意的乱放电,缺乏自省能力. ");
                }
                break;
            case 10:
                if(day>=1 && day <= 22)
                {
                    System.out.println("您的星座是天秤座; \n优点： 理想主义、公正、追求、社交手腕强、审美观、魅力、 艺术力强、美丽、善良 \n 缺点 ：　优柔寡断犹豫不决,意志不坚定容易受人影响,怕得罪人,不能承受压力没有担当,过分要求公平吃不得亏,息事宁人治标不治本,总是自圆其说藉口太多,喜欢享受好逸恶劳,常不经意的乱放电,缺乏自省能力. ");
                }
                else
                {
                    System.out.println("您的星座是天蝎座 ;\n 优点：神秘、逻辑决断能力、理性、独立、直觉、规律、奉献、观察力 、真正魅力、冥想\n 缺点： 太过好强,占有欲过高,善妒爱吃醋,疑心病重,报复心太强,得理不饶人,感情用事明知故犯,口是心非城府太深爱恨太强烈. ");
                }
                break;
            case 11:
                if(day>=1 && day <= 21)
                {
                    System.out.println("您的星座是天蝎座; \n 优点：神秘、逻辑决断能力、理性、独立、直觉、规律、奉献、观察力 、真正魅力、冥想\n 缺点：太过好强,占有欲过高,善妒爱吃醋,疑心病重,报复心太强,得理不饶人,感情用事明知故犯,口是心非城府太深爱恨太强烈. ");
                }
                else
                {
                    System.out.println("您的星座是射手座 ;\n 优点：理性、勇敢、细心、发展力、活泼、廉耻心、热心 ，可爱 \n 缺点：粗心大意,心口直快容易得罪人,缺乏耐性,不懂人情世故,做事冲动不懂三思而行,不信邪不听劝告,过度理想化不切实际,缺乏按部就班的计划,喜怒太形于色.");
                }
                break;
            case 12:
                if(day>=1 && day <= 21)
                {
                    System.out.println("您的星座是射手座;\n 优点： 理性、勇敢、细心、发展力、活泼、廉耻心、热心 ，可爱\n 缺点：粗心大意,心口直快容易得罪人,缺乏耐性,不懂人情世故,做事冲动不懂三思而行,不信邪不听劝告,过度理想化不切实际,缺乏按部就班的计划,喜怒太形于色. ");
                }
                else
                {
                    System.out.println("您的星座是摩羯座 ;\n 优点：优越、聪明、实际、野心、可靠、不屈不挠、宽大 、乐观\n 缺点：太过现实,固执不能随机应变,不够乐观,个人利己主义,缺乏浪漫情趣,过于压抑自己的欲望,太专注于个人的目标,缺乏对人群的关怀和热情.不善于沟通.  ");
                }
                break;

        }
    }
}
